In [1]:
import pandas as pd

In [2]:
# 시리즈 생성
ser1 = pd.Series([11,8,7], index=['금','은','동'])

In [3]:
ser1

금    11
은     8
동     7
dtype: int64

In [4]:
# 데이터 프레임 생성함수
df = pd.DataFrame(['맑음','흐림','비','비','비'], index=['8-3','8-4','8-5','8-6','8-7'], columns=['날씨'])

In [5]:
df

     날씨
8-3  맑음
8-4  흐림
8-5   비
8-6   비
8-7   비

In [6]:
score = pd.read_csv('data/시험성적.csv', encoding='euc-kr')

In [7]:
# loc 인덱서 사용해보기
# 인덱서의 공통 사항
# 항상 행부터 접근
# 콤마 없이 사용하면 행을 선택
score

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26

In [8]:
# loc 실습
# 1반과 2반의 전체 성적을 가져오기
score.loc[:, '과목':'2반']

   과목  1반  2반
0  수학  45  44
1  영어  76  92
2  국어  47  92
3  사회  92  81
4  과학  11  79

In [9]:
# 전체 반의 사회,과학 성적
score.loc[3:,:]

   과목  1반  2반  3반  4반
3  사회  92  81  85  40
4  과학  11  79  47  26

In [10]:
# 3반과 4반의 국어, 사회성적
score.loc[2:4,'3반':'4반']

   3반  4반
2  45  69
3  85  40
4  47  26

In [11]:
# 2반 영어성적
score.loc[1,'2반']

92

In [12]:
score

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26

In [13]:
# iloc 실습
# 1,2 반성적 모두 가져오기
score.iloc[:,1:3]

   1반  2반
0  45  44
1  76  92
2  47  92
3  92  81
4  11  79

In [14]:
# 전체반의 영어,국어 성적
score.iloc[1:3,:]

   과목  1반  2반  3반  4반
1  영어  76  92  45  69
2  국어  47  92  45  69

In [15]:
# 3,4반의
score.iloc[2:4,3:]

   3반  4반
2  45  69
3  85  40

In [16]:
# 2반의 과학성적
score.iloc[4,2]

79

In [17]:
#전체 데이터
score

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26

In [18]:
# loc/iloc 심화문제
# 1반과 3반의 전체 과목 점수 2반제외
score.iloc[:,[1,3]]

   1반  3반
0  45  73
1  76  45
2  47  45
3  92  85
4  11  47

In [19]:
# 전체반의 수학 과학
score.iloc[[0,4],:]

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
4  과학  11  79  47  26

In [20]:
# 2반 3반 영어,사회
score.iloc[[1,3],2:4]

   2반  3반
1  92  45
3  81  85